export const DUMMY_MY_WORK: {
	title: string;
	label: string;
	gallery: { src: string; alt: string }[];
	description: string;
	startDate: Date;
	doneDate: Date;
	status: 0 | 1;
	customer: string;
	location: string;
	url?: string;
} = {
	title: 'طراحی کارت ویزیت',
	label: 'تجربه کاربری',
	gallery: [
		{
			src:
				'http://mimwp.com/theme/arter/demo/light/wp-content/uploads/2020/09/work-4-1280x768.jpg',
			alt: 'tester',
		},
		{
			src:
				'http://mimwp.com/theme/arter/demo/light/wp-content/uploads/2020/09/work-4-1280x768.jpg',
			alt: 'tester',
		},
		{
			src:
				'http://mimwp.com/theme/arter/demo/light/wp-content/uploads/2020/09/work-4-1280x768.jpg',
			alt: 'tester',
		},
		{
			src:
				'http://mimwp.com/theme/arter/demo/light/wp-content/uploads/2020/09/work-4-1280x768.jpg',
			alt: 'tester',
		},
		{
			src:
				'http://mimwp.com/theme/arter/demo/light/wp-content/uploads/2020/09/work-4-1280x768.jpg',
			alt: 'tester',
		},
	],
	description:
		'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.',
	customer: 'عصرفراارتباط',
	doneDate: new Date(),
	location: 'ایران، تهران',
	startDate: new Date(),
	status: 1,
	url: 'https://panel.direct',
};
